[
  {
    "cycle": 1,
    "seed_json": "{\n  \"question\": \"A thin, uniform rod of length $L = 2.00\\\\ \\\\mathrm{m}$ and mass $M = 4.00\\\\ \\\\mathrm{kg}$ is initially at rest in deep space (neglect gravity), with its center of mass at position $\\\\vec{r}_{\\\\rm{CM}} = (0,0,0)$. At time $t=0$, two small identical explosive charges attached at points $A$ and $B$ along the rod (located at $x = -0.5\\\\ \\\\mathrm{m}$ and $x = +0.5\\\\ \\\\mathrm{m}$, respectively, on the rod's axis; both with negligible mass) are detonated **simultaneously**. Each explosion instantaneously imparts an impulse $J = 2.00\\\\ \\\\mathrm{N \\\\! \\\\cdot \\\\! s}$ \\\\\\\\perpendicular to the rod but in opposite $\\\\hat{y}$-directions: at $A$, the impulse is in $+\\\\hat{y}$, at $B$ in $-\\\\hat{y}$. Immediately **after** the explosion, the rod is released inside a straight frictionless tube aligned along the $y$-axis that moves with **constant acceleration** $a_{\\\\rm tube} = 3.00\\\\ \\\\mathrm{m/s^2}$ in the $+y$ direction relative to the inertial lab frame. (\\nAssume no external forces act on the rod except contact with the tube walls that constrains the rod's center of mass to move only along the $y$-axis. Neglect air resistance. The rod can freely translate and rotate inside the tube; collisions with the tube walls are frictionless.)\\n\\nA **position-dependent spring force** $F_y(y)$ acts on the center of mass of the rod due to a mechanism in the tube, as shown below:\\n\\n\\\\[\\nF_y(y) = \\n\\\\begin{cases}\\n  -k_1 \\\\ y, & \\\\text{for } y \\\\leq 0 \\\\\\\\\\n  -k_2 \\\\ y, & \\\\text{for } y > 0\\n\\\\end{cases}\\n\\\\]\\n\\nwhere $k_1 = 30.0$ N/m and $k_2 = 60.0$ N/m, and $y$ is the position of the rod's center of mass relative to $y=0$ (the tube's center).\\n\\n### (a) **At the instant the explosions occur ($t=0$), find the rod’s angular velocity $\\\\omega_0$ about its center of mass.**\\n\\n### (b) **In the reference frame of the accelerating tube ($+y$ direction, $a_{\\\\rm tube}$), write the net force acting on the rod’s center of mass for $y>0$. Clearly account for the appropriate pseudo-force.**\\n\\n### (c) **Given the initial velocity imparted by the impulses, the position-dependent force, and the tube’s acceleration, determine the maximum displacement $y_\\\\mathrm{max}$ (measured from $y=0$) reached by the center of mass after the explosions, considering only motion in the $y$-direction. (The rotational motion does not affect this part due to the tube's constraint.)**\\n\\n---\\n\\n**Use the following constants:**\\n- $M = 4.00\\\\ \\\\mathrm{kg}$\\n- $L = 2.00\\\\ \\\\mathrm{m}$\\n- $J = 2.00\\\\ \\\\mathrm{N \\\\!\\\\cdot\\\\! s}$\\n- $a_{\\\\rm tube} = 3.00\\\\ \\\\mathrm{m/s^2}$\\n- $k_1 = 30.0\\\\ \\\\mathrm{N/m}$\\n- $k_2 = 60.0\\\\ \\\\mathrm{N/m}$\\n- $g = 9.81\\\\ \\\\mathrm{m/s^2}$ (for pseudo-force calculation only if needed)\\n\\n**Assume:**\\n- The rod does not slip or contact with the tube walls during rotation while moving along $y$. If needed, treat rotational and translational motions as decoupled due to geometry and frictionless walls.\\n- Ignore gravitational forces except for pseudo-forces required by the non-inertial tube frame.\\n\\n---\\n\\n**What is the value of the maximum displacement $y_{\\\\rm max}$ (in meters, SI units, accurate to $\\\\pm 0.01\\\\ \\\\mathrm{m}$) of the rod’s center of mass—**\\\\textbf{relative to $y=0$ in the accelerating tube frame}**—after the explosions? (Give your answer as a positive number.)\\n\\n\\\\[\\n\\\\boxed{y_{\\\\rm max} =\\\\, ?\\\\ \\\\mathrm{m}}\\n\\\\]\",\n  \"topic_tags\": [\n    \"center of mass\",\n    \"explosions\",\n    \"impulse\",\n    \"non-inertial frames\",\n    \"graphical force analysis\",\n    \"potential energy curves\",\n    \"rotational dynamics\",\n    \"pseudo-forces\",\n    \"position-dependent forces\"\n  ]\n}",
    "extracted": "{\n  \"parameters\": [\n    {\"symbol\": \"L\",           \"meaning\": \"length of the thin uniform rod\",                         \"unit\": \"m\"},\n    {\"symbol\": \"M\",           \"meaning\": \"mass of the rod\",                                        \"unit\": \"kg\"},\n    {\"symbol\": \"\\\\vec{r}_{\\\\rm CM}\", \"meaning\": \"initial position vector of the rod’s center of mass\", \"unit\": \"m\"},\n    {\"symbol\": \"x_A\",         \"meaning\": \"location of point A on the rod’s axis (measured from CM)\", \"unit\": \"m\"},\n    {\"symbol\": \"x_B\",         \"meaning\": \"location of point B on the rod’s axis (measured from CM)\", \"unit\": \"m\"},\n    {\"symbol\": \"J\",           \"meaning\": \"magnitude of each impulse delivered by the explosive charges\", \"unit\": \"N·s\"},\n    {\"symbol\": \"t\",           \"meaning\": \"time after the explosions are triggered (t = 0 at detonation)\", \"unit\": \"s\"},\n    {\"symbol\": \"I_{\\\\rm CM}\", \"meaning\": \"moment of inertia of the rod about its center of mass\",  \"unit\": \"kg·m^2\"},\n    {\"symbol\": \"\\\\omega_0\",   \"meaning\": \"angular velocity of the rod about its center of mass immediately after the explosions\", \"unit\": \"rad/s\"},\n    {\"symbol\": \"a_{\\\\rm tube}\",\"meaning\": \"constant linear acceleration of the tube in the +y direction (lab frame)\", \"unit\": \"m/s^2\"},\n    {\"symbol\": \"y\",           \"meaning\": \"instantaneous CM position of the rod measured along the tube from y = 0\", \"unit\": \"m\"},\n    {\"symbol\": \"F_y(y)\",      \"meaning\": \"position-dependent spring force acting on the CM along y\", \"unit\": \"N\"},\n    {\"symbol\": \"k_1\",         \"meaning\": \"spring constant for y ≤ 0 region inside the tube\",       \"unit\": \"N/m\"},\n    {\"symbol\": \"k_2\",         \"meaning\": \"spring constant for y > 0 region inside the tube\",       \"unit\": \"N/m\"},\n    {\"symbol\": \"y_{\\\\rm max}\", \"meaning\": \"maximum positive displacement of the CM from y = 0 in the tube frame\", \"unit\": \"m\"},\n    {\"symbol\": \"g\",           \"meaning\": \"magnitude of the standard gravitational field (provided for reference / pseudo-force bookkeeping)\", \"unit\": \"m/s^2\"}\n  ],\n  \"assumptions\": [\n    \"Rod is thin, perfectly uniform, and rigid.\",\n    \"Explosive charges have negligible mass; their only effect is to deliver the stated impulses instantaneously.\",\n    \"Impulses at A and B occur simultaneously.\",\n    \"Initial state is in deep space; real gravitational forces are neglected.\",\n    \"After detonation the rod is inside a straight tube that constrains its center of mass motion strictly to the y-axis.\",\n    \"Contacts with the tube walls are frictionless; no torque is transmitted through these contacts.\",\n    \"The tube itself translates with a constant acceleration a_tube relative to an inertial lab frame.\",\n    \"Air resistance and any other dissipative forces are neglected.\",\n    \"Rotational motion of the rod is dynamically decoupled from its translational motion along y under the stated constraints.\",\n    \"Piece-wise linear spring force is the only real external force along y (aside from normal constraints); its constants k1 and k2 are position independent within their regions.\",\n    \"When switching to the non-inertial tube frame, an appropriate uniform pseudo-force −M a_tube \\\\hat y must be included.\",\n    \"Collisions between the rod and tube walls, should they occur, are perfectly elastic and frictionless (though the problem states none occur during the motion considered).\"\n  ],\n  \"concepts\": [\n    \"Impulse–momentum theorem: relates each applied impulse J to the change in linear momentum at the application points.\",\n    \"Angular impulse–angular momentum theorem: equal and opposite linear impulses at different points create a net torque impulse about the CM, giving the rod an initial angular momentum L = I ω.\",\n    \"Moment of inertia of a uniform thin rod about its center (I = (1/12) M L^2): required to convert torque impulse to initial angular velocity ω₀.\",\n    \"Conservation of linear momentum for the rod’s CM in the absence of external impulses during detonation (internal forces cancel).\",\n    \"Hooke’s law (linear spring force): F_y = −k y, here with two different effective spring constants k1 and k2 depending on position.\",\n    \"Newton’s second law in a non-inertial (accelerating) reference frame: inclusion of a pseudo-force −M a_tube opposite the frame’s acceleration.\",\n    \"Work-energy (or effective potential) method for 1-D motion with position-dependent conservative force: used to find maximum displacement y_max when kinetic energy becomes zero.\",\n    \"Independence of translational and rotational dynamics for a rigid body when external torques about the CM are absent (rotation does not influence CM motion in this setup).\",\n    \"Constraint (holonomic) motion: the rod’s CM is restricted to a straight line (the y-axis) by the tube walls.\",\n    \"Uniformly accelerated reference frames and fictitious forces (d'Alembert principle).\"\n  ]\n}",
    "tougher_question": "{\n  \"question\": \"A thin, perfectly uniform rigid rod of length $L = 1.20\\\\ \\\\mathrm{m}$ and mass $M = 3.00\\\\ \\\\mathrm{kg}$ lies at rest in deep space (inertial frame). At $t=0$, two explosive charges at points $A$ and $B$ on the rod's axis (measured from the center of mass) at $x_A = -0.350\\\\ \\\\mathrm{m}$ and $x_B = +0.500\\\\ \\\\mathrm{m}$ simultaneously deliver equal and opposite impulses $\\\\pm J$, each of magnitude $J = 2.10\\\\ \\\\mathrm{N \\\\cdot s}$, perpendicular to the rod’s axis, along the $\\\\hat y$ direction. Immediately after, the rod and its center of mass are inserted (without loss of generality and without adding any extra motion) into a straight, frictionless tube that constrains the rod’s center of mass (but not its orientation) to move strictly along the $y$-axis. The tube is perfectly aligned along the $y$-direction and translates with a constant linear acceleration $a_{\\\\rm tube} = 5.80\\\\ \\\\mathrm{m/s^2}$ in the $+y$ direction relative to an inertial laboratory frame (and maintains this acceleration throughout). Inside the tube, the only non-constraint force on the rod is a piecewise linear spring force $F_y(y)$ acting along $\\\\hat y$, exerted by the tube walls on the rod's center of mass:\\n\\n\\\\[\\nF_y(y)=\\\\begin{cases}\\n  -k_1 y, & y \\\\leq 0 \\\\\\\\\\n  -k_2 y, & y > 0\\n\\\\end{cases}\\n\\\\]\\nwith $k_1 = 80.0\\\\ \\\\mathrm{N/m}$ and $k_2 = 170.0\\\\ \\\\mathrm{N/m}$. The mass of the tube is negligible.\\n\\nNeglect all dissipative forces. At $t = 0$, the rod’s center of mass is at $\\\\vec{r}_{\\\\rm CM}(0) = (0,0,0)$ and its linear and angular velocities are determined solely by the impulses. Assume the rod never touches the tube ends during this motion. The gravitational field $g$ is irrelevant except as a bookkeeping device for inertial pseudo-forces, and rotational and translational dynamics are fully decoupled under the conditions given.\\n\\nCompute the **maximum positive displacement $y_{\\\\rm max}$** of the center of mass (relative to $y = 0$ in the tube frame) attained by the rod during its subsequent motion, as measured in the instantaneous rest frame of the tube. Express your answer with three significant digits and include the correct SI unit—box your result:\\n\\n\\\\[\\n\\\\boxed{y_{\\\\rm max} = \\\\ ?}\\n\\\\]\\n\\n\",\n  \"topic_tags\": [\n    \"mechanics\",\n    \"rigid body dynamics\",\n    \"impulse and momentum\",\n    \"non-inertial frames\",\n    \"work-energy theorem\",\n    \"oscillatory motion\",\n    \"piecewise forces\"\n  ]\n}",
    "feedback": "Several points in the prompt compromise clarity and physical coherence. \n\nAmbiguities – “inserting” a freely rotating 1.20 m rod into a straight tube with zero clearance yet “without adding any extra motion” is physically impossible unless additional (ignored) forces act; the phrase “without loss of generality” hand-waves this contradiction.  The tube is said to constrain only the centre-of-mass but not the orientation, yet a real tube would almost certainly torque or collide with the rod as it rotates; the promise that the rod “never touches the tube ends” does not resolve side-wall contact.  The spring force is applied “by the tube walls on the rod's centre of mass”, but a wall force acting strictly at the CM is non-physical and contradicts the earlier statement that translation and rotation are “fully decoupled”.  The sign convention for the fictitious force in the tube frame is left implicit: at y = 0 the stated spring force is zero, so the CM can only start moving if one assumes an unspoken downward pseudo-force −Ma_tube; this should be stated explicitly.\n\nConsistency – Length L, impulse magnitude J and lever arms x_A, x_B are meticulously specified, yet the net linear impulse is zero, making every rotational datum irrelevant to the requested y_max.  Likewise g is introduced as a “book-keeping device” but never quantified or used.  Symbol a_{tube} is clear, but the problem later speaks of the “instantaneous rest frame of the tube”, while a_{tube} is constant; the distinction between lab frame and tube frame is muddled but crucial to sign conventions.\n\nLogical flow – The question leaps from an impulse scenario to a 1-D piecewise oscillator without justifying why rotational motion never couples back (e.g. through time-varying wall contact).  Claiming “rotational and translational dynamics are fully decoupled under the conditions given” is an assertion, not a demonstrated result.\n\nAssumptions – Neglecting wall/rod torques, clearance, and insertion dynamics are strong hidden assumptions; the spring constants k₁, k₂ implicitly act for all |y| with no physical limit, an unrealistic idealisation that should be declared.  No reason is given for the piecewise stiffness; it is physically irrelevant but complicates the mathematics.\n\nSingle-answer criterion – The prompt does end with one boxed quantity, so that part is satisfied; however the surplus rotational data and mention of g encourage unnecessary intermediate work.\n\nIn short, delete the rotational/impulse back-story or explicitly state it is irrelevant, clarify how the CM experiences a spring force while free to rotate, declare the fictitious force in the tube frame, and justify (or drop) the claim of complete translation–rotation decoupling.",
    "improved_question": "{\n  \"question\": \"A point mass $M = 3.00\\\\ \\\\mathrm{kg}$ is rigidly attached to an ultra-light guide so that it is free to translate only along the $y$-axis in deep space. The initial position at $t=0$ is $y(0) = 0$ and the mass is at rest. At $t = 0^+$, the entire assembly is placed inside a frictionless, perfectly straight tube aligned with the $y$-axis, which immediately begins to accelerate linearly with constant magnitude $a_{\\\\mathrm{tube}} = 5.80\\\\ \\\\mathrm{m/s^2}$ in the $+y$ direction, relative to a fixed inertial laboratory frame. The motion is otherwise unaffected by gravity or other external fields. A restoring force $F_y(y)$ acts strictly on the mass's center of mass via internal springs (not from the walls), given by\\n\\n\\\\[\\nF_y(y) = \\\\begin{cases}\\n  -k_1 y, & y \\\\leq 0 \\\\\\\\\\n  -k_2 y, & y > 0\\n\\\\end{cases}\\n\\\\]\\n\\nwith $k_1 = 80.0\\\\ \\\\mathrm{N/m}$ and $k_2 = 170.0\\\\ \\\\mathrm{N/m}$. The tube is sufficiently long that edge effects may be neglected. All components are idealized as point-like, and the springs act without limit for all $y$. At all times, the only forces on the mass are $F_y(y)$ and those required to constrain the motion to the $y$-axis; there are no dissipative forces of any kind.\\n\\nThroughout, consider the non-inertial rest frame of the accelerating tube. In this frame, the equation of motion for the mass is\\n\\\\[\\nM \\\\frac{d^2 y}{dt^2} = F_y(y) - M a_{\\\\mathrm{tube}}\\\\,,\\n\\\\]\\nand at $t=0$ the mass is located at $y = 0$ and is at rest relative to the tube.\\n\\nCalculate the **maximum positive displacement $y_{\\\\rm max}$** of the mass, as measured from $y = 0$ in the tube frame, that the mass attains during its resulting motion, and express your answer as:\\n\\n\\\\[\\n\\\\boxed{y_{\\\\rm max} =\\\\ ?}\\n\\\\]\\nwith three significant digits and correct SI units.\",\n  \"topic_tags\": [\n    \"oscillatory motion\",\n    \"non-inertial frames\",\n    \"mechanics\",\n    \"differential equations\",\n    \"piecewise forces\",\n    \"work-energy theorem\"\n  ]\n}",
    "ans_gpt": "\\boxed{y_{\\rm max}=0.000\\ \\text{m}}",
    "ans_o3": "\"y_max = 0.000 m\"",
    "similarity_result": {
      "similarity_score": 1.0,
      "decision": "similar",
      "comment": "Both answers give y_max = 0.000 m; numerical value and units coincide exactly."
    }
  },
  {
    "cycle": 2,
    "seed_json": "{\n  \"question\": \"A point mass $M = 3.00\\\\ \\\\mathrm{kg}$ is rigidly attached to an ultra-light guide so that it is free to translate only along the $y$-axis in deep space. The initial position at $t=0$ is $y(0) = 0$ and the mass is at rest. At $t = 0^+$, the entire assembly is placed inside a frictionless, perfectly straight tube aligned with the $y$-axis, which immediately begins to accelerate linearly with constant magnitude $a_{\\\\mathrm{tube}} = 5.80\\\\ \\\\mathrm{m/s^2}$ in the $+y$ direction, relative to a fixed inertial laboratory frame. The motion is otherwise unaffected by gravity or other external fields. A restoring force $F_y(y)$ acts strictly on the mass's center of mass via internal springs (not from the walls), given by\\n\\n\\\\[\\nF_y(y) = \\\\begin{cases}\\n  -k_1 y, & y \\\\leq 0 \\\\\\\\\\n  -k_2 y, & y > 0\\n\\\\end{cases}\\n\\\\]\\n\\nwith $k_1 = 80.0\\\\ \\\\mathrm{N/m}$ and $k_2 = 170.0\\\\ \\\\mathrm{N/m}$. The tube is sufficiently long that edge effects may be neglected. All components are idealized as point-like, and the springs act without limit for all $y$. At all times, the only forces on the mass are $F_y(y)$ and those required to constrain the motion to the $y$-axis; there are no dissipative forces of any kind.\\n\\nThroughout, consider the non-inertial rest frame of the accelerating tube. In this frame, the equation of motion for the mass is\\n\\\\[\\nM \\\\frac{d^2 y}{dt^2} = F_y(y) - M a_{\\\\mathrm{tube}}\\\\,,\\n\\\\]\\nand at $t=0$ the mass is located at $y = 0$ and is at rest relative to the tube.\\n\\nCalculate the **maximum positive displacement $y_{\\\\rm max}$** of the mass, as measured from $y = 0$ in the tube frame, that the mass attains during its resulting motion, and express your answer as:\\n\\n\\\\[\\n\\\\boxed{y_{\\\\rm max} =\\\\ ?}\\n\\\\]\\nwith three significant digits and correct SI units.\",\n  \"topic_tags\": [\n    \"oscillatory motion\",\n    \"non-inertial frames\",\n    \"mechanics\",\n    \"differential equations\",\n    \"piecewise forces\",\n    \"work-energy theorem\"\n  ]\n}",
    "extracted": "{\n  \"parameters\": [\n    {\"symbol\": \"M\", \"meaning\": \"mass of the point object\", \"unit\": \"kg\"},\n    {\"symbol\": \"y\", \"meaning\": \"instantaneous displacement of the mass measured along the y-axis in the tube frame\", \"unit\": \"m\"},\n    {\"symbol\": \"t\", \"meaning\": \"time elapsed since t = 0\", \"unit\": \"s\"},\n    {\"symbol\": \"a_{\\\\mathrm{tube}}\", \"meaning\": \"constant linear acceleration of the tube relative to the inertial laboratory frame\", \"unit\": \"m/s^2\"},\n    {\"symbol\": \"k_1\", \"meaning\": \"spring constant for y ≤ 0 branch of the restoring force\", \"unit\": \"N/m\"},\n    {\"symbol\": \"k_2\", \"meaning\": \"spring constant for y > 0 branch of the restoring force\", \"unit\": \"N/m\"},\n    {\"symbol\": \"F_y(y)\", \"meaning\": \"piece-wise linear restoring force acting on the mass\", \"unit\": \"N\"},\n    {\"symbol\": \"y_{\\\\rm max}\", \"meaning\": \"maximum positive displacement reached by the mass in the tube frame\", \"unit\": \"m\"}\n  ],\n  \"assumptions\": [\n    \"Motion occurs in deep space; gravitational field is neglected.\",\n    \"The tube is perfectly straight, aligned with the y-axis, and frictionless.\",\n    \"The tube accelerates with constant magnitude a_{tube} in +y direction (non-inertial frame is uniformly accelerating).\",\n    \"Mass is a point particle rigidly constrained to move only along the y-axis.\",\n    \"Only forces on the mass are the restoring spring force F_y(y) and the fictitious (pseudo) force from the non-inertial frame; no dissipative forces (no friction, no air resistance, no damping).\",\n    \"Springs obey ideal Hooke-like behavior, linear in displacement, with different constants on the two sides of y = 0; they act without limit.\",\n    \"Edge effects of the tube are neglected (tube considered infinitely long).\",\n    \"All quantities are treated classically; relativistic effects are ignored.\",\n    \"The pseudo-force −M a_{tube} acts uniformly and can be derived from a constant potential in the accelerating frame.\"\n  ],\n  \"concepts\": [\n    \"Newton’s Second Law in a Non-Inertial Frame – introduces a fictitious force −M a_{tube} to write the equation of motion in the accelerating tube frame.\",\n    \"Hooke’s Law – provides the linear restoring forces −k_1 y and −k_2 y for negative and positive displacements, respectively.\",\n    \"Piecewise Linear Systems – the motion is governed by two different harmonic regimes depending on the sign of y.\",\n    \"Conservation of Mechanical Energy – because all forces (restoring + pseudo-force) are conservative and no dissipation is present, total mechanical energy remains constant; this is used to find the turning point y_{max}.\",\n    \"Work–Energy Theorem – relates the work done by conservative forces to changes in kinetic and potential energy; employed to locate points of zero kinetic energy (turning points).\",\n    \"Simple Harmonic Motion (SHM) – within each region (y ≤ 0 or y > 0) the particle follows SHM with angular frequencies √(k_1/M) or √(k_2/M).\",\n    \"Effective Potential in Accelerated Frames – the pseudo-force contributes a linear potential −M a_{tube} y, modifying the equilibrium position and the turning point.\",\n    \"Initial Conditions – starting from rest at y = 0 determines the total energy used in the conservation analysis.\"\n  ]\n}",
    "tougher_question": "{\n  \"question\": \"A perfectly rigid, frictionless, infinitely long tube is aligned along the $y$-axis in otherwise empty space, neglecting all external gravitational fields. The tube accelerates in the $+y$ direction with a fixed acceleration $a_{\\\\mathrm{tube}} = 3.70\\\\ \\\\mathrm{m/s^2}$ relative to an inertial lab frame. A point mass $M = 1.50\\\\ \\\\mathrm{kg}$ is constrained to move only along the $y$-axis inside the tube. The mass is subject to a piecewise linear restoring force:\\n\\\\[\\nF_y(y) = \\\\begin{cases}\\n    -k_1 y & \\\\text{if}\\\\ y \\\\leq 0 \\\\\\\\\\n    -k_2 y & \\\\text{if}\\\\ y > 0\\n\\\\end{cases}\\n\\\\]\\nwith $k_1 = 190\\\\ \\\\mathrm{N/m}$, $k_2 = 470\\\\ \\\\mathrm{N/m}$. At $t = 0$, the system is released from rest with the mass at $y = 0$ (all quantities measured in the frame of the tube).  \\n\\n(a) Rigorously accounting for: (\\ni) the effect of the non-inertial (accelerating) frame and its potential,\\n(ii) the asymmetric piecewise restoring force, and\\n(iii) the exact classical conservation of energy, calculate the exact \\\\\\\\textbf{maximum positive displacement} $y_{\\\\rm max}$ (in $\\\\mathrm{m}$, three decimal places) the mass will attain **after release from rest at $y = 0$**, in the accelerating tube frame.  Give your answer as:\\n\\n\\\\[ \\\\boxed{\\\\ y_{\\\\rm max} = \\\\;\\\\text{?}\\\\ \\\\mathrm{m} \\\\ } \\\\]\\n\\n\",\n  \"topic_tags\": [\"classical mechanics\", \"non-inertial reference frames\", \"piecewise potentials\", \"conservation of energy\", \"advanced oscillatory motion\"]\n}",
    "feedback": "Ambiguities and missing specifications undermine a unique, well-posed answer. 1)  The sign convention for the inertial (pseudo-)force is never spelled out: the tube accelerates in +y, so in its frame the mass feels −M a_tube in the −y direction, but the question never states this explicitly; without it the student cannot be sure which side is “uphill” in the effective potential. 2)  The restoring force is discontinuous at y = 0, yet the mass is released exactly at that point; the force (and therefore the initial acceleration) is undefined unless one declares F(0)=0, adopts a limiting value, or chooses one branch. 3)  All “quantities are measured in the frame of the tube”, but the given F_y(y)=−k y looks like a force relative to a fixed origin, not relative to the moving tube; a phrasing such as “in the co-moving frame the restoring force is …” is needed. 4)  The energy to be “exactly conserved” in a non-inertial frame requires including a potential −M a_tube y; this potential is nowhere written, nor is its reference level defined, so any numeric energy balance is ambiguous. 5)  Mass M is supplied but, if the pseudo-potential is included, M cancels in the turning-point calculation; this hints the setter may have overlooked that point or that some hidden mass-dependent step is assumed. 6)  Declaring the tube “infinitely long” is irrelevant, while the real constraint is that the piecewise spring potential confines the motion; the superfluous statement distracts from the real physics. 7)  The request for “three decimal places” and the word “exact” conflict unless the problem guarantees a simple analytic root; that guarantee is absent. 8)  Although only one final number is asked, the parenthetical list “(i)…(ii)…(iii)” effectively demands the solver to present intermediate reasoning steps, contradicting the instruction that no sub-questions appear. 9)  No damping or other non-ideal effects are mentioned, implicitly assuming perfectly conservative motion—this should be stated explicitly. 10)  Finally, the phrase “maximum positive displacement … after release from rest at y=0” is ambiguous if the motion never becomes positive for the chosen sign convention; the question must first ensure that y actually crosses into y>0.  Clarifying these points, explicitly writing the inertial potential, defining F at y=0, and deleting extraneous phrases would yield an unambiguous single-answer problem.",
    "improved_question": "{\n  \"question\": \"A point mass $M = 1.50\\\\ \\\\mathrm{kg}$ is constrained to move along the $y$-axis inside a perfectly rigid, frictionless tube. All measurements are made \\\\\\\\textbf{in the instantaneous reference frame of the tube}. The tube is infinitely long, aligned along the $y$-axis, and is accelerating with constant proper acceleration $a_{\\\\rm tube} = 3.70\\\\ \\\\mathrm{m/s^2}$ in the $+y$ direction relative to an inertial laboratory frame. \\n\\nThe restoring force acting on the mass in the tube frame is \\\\\\\\textbf{defined for all $y$ as}\\n\\\\[\\nF_{\\\\rm s}(y) = \\\\begin{cases}\\n    -k_1 y & (y < 0) \\\\\\\\ \\n    -k_2 y & (y > 0) \\\\\\\\\\n    0 & (y = 0)\\n\\\\end{cases} \\\\qquad \\\\text{where $k_1 = 190\\\\ \\\\mathrm{N/m}$, $k_2 = 470\\\\ \\\\mathrm{N/m}$}\\n\\\\]\\n\\nThe only forces acting on the mass are the restoring force $F_{\\\\rm s}$ and the apparent inertial (fictitious) force due to the non-inertial tube frame. \\\\\\\\textbf{Neglect all other forces, including gravity, friction, and damping effects}. The inertial force experienced in the accelerating frame is $F_{\\\\rm in}(y) = - M a_{\\\\rm tube}$ for all $y$ (i.e., acts everywhere in the $-y$ direction). \\n\\nAt time $t=0$, the mass is released \\\\\\\\textbf{from rest at $y = 0$} (as measured in the tube frame).\\n\\nThe total effective potential energy in the tube frame is thus given by\\n\\\\[\\nU(y) = \\\\begin{cases}\\n    \\\\frac{1}{2}k_1 y^2 + M a_{\\\\rm tube} y, & y < 0 \\\\\\\\\\n    \\\\frac{1}{2}k_2 y^2 + M a_{\\\\rm tube} y, & y > 0 \\\\\\\\\\n    0, & y = 0 \\\\quad \\\\text{(reference level)}\\n\\\\end{cases}\\n\\\\]\\nIf the mass reaches a maximum positive displacement $y_{\\\\max}$ (i.e., its first turning point with $y > 0$ after release), it instantaneously comes to rest there.\\n\\n\\\\\\\\textbf{Calculate the exact numeric value (in $\\\\mathrm{m}$, to three decimal places) of the maximum positive displacement $y_{\\\\max}$ attained by the mass after release from rest at $y = 0$, in the tube frame. Use exact energy conservation, accounting for the piecewise-linear restoring force and the inertial (pseudo-)potential.}\\n\\nGive your answer as:\\n\\n\\\\[\\n\\\\boxed{\\\\ y_{\\\\rm max} = \\\\;\\\\text{?}\\\\ \\\\mathrm{m} \\\\ }\\n\\\\]\\n\",\n  \"topic_tags\": [\n    \"classical mechanics\",\n    \"non-inertial reference frames\",\n    \"piecewise potentials\",\n    \"energy conservation\",\n    \"oscillatory motion\"\n  ]\n}",
    "ans_gpt": "\\boxed{\\,y_{\\rm max} = 0.000\\ \\mathrm{m}\\,}",
    "ans_o3": "\\boxed{\\,y_{\\max} = 0.000\\ \\mathrm{m}\\,}",
    "similarity_result": {
      "similarity_score": 1.0,
      "decision": "similar",
      "comment": "Identical numerical value (0.000) and identical units (m)."
    }
  },
  {
    "cycle": 3,
    "seed_json": "{\n  \"question\": \"A point mass $M = 1.50\\\\ \\\\mathrm{kg}$ is constrained to move along the $y$-axis inside a perfectly rigid, frictionless tube. All measurements are made \\\\\\\\textbf{in the instantaneous reference frame of the tube}. The tube is infinitely long, aligned along the $y$-axis, and is accelerating with constant proper acceleration $a_{\\\\rm tube} = 3.70\\\\ \\\\mathrm{m/s^2}$ in the $+y$ direction relative to an inertial laboratory frame. \\n\\nThe restoring force acting on the mass in the tube frame is \\\\\\\\textbf{defined for all $y$ as}\\n\\\\[\\nF_{\\\\rm s}(y) = \\\\begin{cases}\\n    -k_1 y & (y < 0) \\\\\\\\ \\n    -k_2 y & (y > 0) \\\\\\\\\\n    0 & (y = 0)\\n\\\\end{cases} \\\\qquad \\\\text{where $k_1 = 190\\\\ \\\\mathrm{N/m}$, $k_2 = 470\\\\ \\\\mathrm{N/m}$}\\n\\\\]\\n\\nThe only forces acting on the mass are the restoring force $F_{\\\\rm s}$ and the apparent inertial (fictitious) force due to the non-inertial tube frame. \\\\\\\\textbf{Neglect all other forces, including gravity, friction, and damping effects}. The inertial force experienced in the accelerating frame is $F_{\\\\rm in}(y) = - M a_{\\\\rm tube}$ for all $y$ (i.e., acts everywhere in the $-y$ direction). \\n\\nAt time $t=0$, the mass is released \\\\\\\\textbf{from rest at $y = 0$} (as measured in the tube frame).\\n\\nThe total effective potential energy in the tube frame is thus given by\\n\\\\[\\nU(y) = \\\\begin{cases}\\n    \\\\frac{1}{2}k_1 y^2 + M a_{\\\\rm tube} y, & y < 0 \\\\\\\\\\n    \\\\frac{1}{2}k_2 y^2 + M a_{\\\\rm tube} y, & y > 0 \\\\\\\\\\n    0, & y = 0 \\\\quad \\\\text{(reference level)}\\n\\\\end{cases}\\n\\\\]\\nIf the mass reaches a maximum positive displacement $y_{\\\\max}$ (i.e., its first turning point with $y > 0$ after release), it instantaneously comes to rest there.\\n\\n\\\\\\\\textbf{Calculate the exact numeric value (in $\\\\mathrm{m}$, to three decimal places) of the maximum positive displacement $y_{\\\\max}$ attained by the mass after release from rest at $y = 0$, in the tube frame. Use exact energy conservation, accounting for the piecewise-linear restoring force and the inertial (pseudo-)potential.}\\n\\nGive your answer as:\\n\\n\\\\[\\n\\\\boxed{\\\\ y_{\\\\rm max} = \\\\;\\\\text{?}\\\\ \\\\mathrm{m} \\\\ }\\n\\\\]\\n\",\n  \"topic_tags\": [\n    \"classical mechanics\",\n    \"non-inertial reference frames\",\n    \"piecewise potentials\",\n    \"energy conservation\",\n    \"oscillatory motion\"\n  ]\n}",
    "extracted": "{\n  \"parameters\": [\n    {\"symbol\": \"M\", \"meaning\": \"mass of the point particle\", \"unit\": \"kg\"},\n    {\"symbol\": \"a_{\\\\rm tube}\", \"meaning\": \"constant proper acceleration of the tube in the +y direction (magnitude of inertial-frame acceleration)\", \"unit\": \"m/s^2\"},\n    {\"symbol\": \"k_1\", \"meaning\": \"spring (restoring-force) constant for y<0 region\", \"unit\": \"N/m\"},\n    {\"symbol\": \"k_2\", \"meaning\": \"spring (restoring-force) constant for y>0 region\", \"unit\": \"N/m\"},\n    {\"symbol\": \"y\", \"meaning\": \"instantaneous displacement of the mass measured along the tube axis in the tube frame\", \"unit\": \"m\"},\n    {\"symbol\": \"t\", \"meaning\": \"time measured in the tube frame\", \"unit\": \"s\"},\n    {\"symbol\": \"F_{\\\\rm s}(y)\", \"meaning\": \"piece-wise linear restoring force exerted by the tube on the mass\", \"unit\": \"N\"},\n    {\"symbol\": \"F_{\\\\rm in}(y)\", \"meaning\": \"inertial (fictitious) force experienced in the accelerating non-inertial frame\", \"unit\": \"N\"},\n    {\"symbol\": \"U(y)\", \"meaning\": \"total effective potential energy (spring + pseudo-potential) in the tube frame\", \"unit\": \"J\"},\n    {\"symbol\": \"y_{\\\\max}\", \"meaning\": \"first (largest) positive turning-point displacement reached after release\", \"unit\": \"m\"},\n    \n    /* numeric values explicitly given */\n    {\"symbol\": \"M = 1.50\", \"meaning\": \"numerical value of the mass\", \"unit\": \"kg\"},\n    {\"symbol\": \"a_{\\\\rm tube} = 3.70\", \"meaning\": \"numerical value of the tube's proper acceleration\", \"unit\": \"m/s^2\"},\n    {\"symbol\": \"k_1 = 190\", \"meaning\": \"numerical value of k1\", \"unit\": \"N/m\"},\n    {\"symbol\": \"k_2 = 470\", \"meaning\": \"numerical value of k2\", \"unit\": \"N/m\"}\n  ],\n  \n  \"assumptions\": [\n    \"Motion is strictly one-dimensional along the y-axis inside the tube\",\n    \"Tube is perfectly rigid and frictionless (no dissipative forces)\",\n    \"Only forces present in the tube frame are the piece-wise linear restoring force and the constant inertial (fictitious) force; gravity and all other forces are neglected\",\n    \"Tube’s proper acceleration is constant in magnitude and direction (+y) so the inertial force is uniform and time-independent\",\n    \"Point mass is released from rest at y = 0 at t = 0\",\n    \"Mechanical energy is conserved because all remaining forces are conservative\",\n    \"Non-relativistic regime; classical mechanics is valid\",\n    \"No deformation or motion of the tube itself other than its translational acceleration, so the frame is instantaneously co-moving and non-rotating\",\n    \"Mass of the tube is irrelevant (effectively infinite compared to the point mass)\",\n    \"Spring constants k1 and k2 are truly constant and linear for all displacements in their respective regions\"\n  ],\n  \n  \"concepts\": [\n    \"Newton’s second law in a non-inertial frame: real forces plus fictitious inertial force determine motion\",\n    \"Effective (generalized) potential energy: conservative forces (spring) plus pseudo-potential from constant acceleration give U(y)\",\n    \"Work–energy / mechanical energy conservation: total mechanical energy remains constant because only conservative forces act\",\n    \"Turning point condition: at y = y_max the kinetic energy is zero, so total energy equals potential energy\",\n    \"Piecewise linear restoring force: different spring constants k1 and k2 for y < 0 and y > 0 must be handled separately in energy calculations\",\n    \"Simple harmonic oscillator ideas (Hooke’s law) applied separately on each side of y = 0\",\n    \"Uniform gravitational-like field analogy: constant inertial force acts like a uniform field producing a linear potential\",\n    \"Reference potential choice: potential energy is set to zero at y = 0 for convenience\"\n  ]\n}",
    "tougher_question": "{\n  \"question\": \"Consider a point mass $M = 1.50\\\\ \\\\mathrm{kg}$ constrained to move frictionlessly along the $y$-axis inside a perfectly rigid, infinitely long tube. The tube, carrying the mass, undergoes constant proper acceleration $a_{\\\\rm tube} = 3.70\\\\ \\\\mathrm{m/s}^2$ in the $+y$ direction with respect to the inertial lab frame. \\n\\nInside the tube, the restoring force on the mass is defined piecewise: for $y<0$, $F_{\\\\rm s}(y) = -k_1 y$ with $k_1 = 190\\\\ \\\\mathrm{N/m}$; for $y>0$, $F_{\\\\rm s}(y) = -k_2 y$ with $k_2 = 470\\\\ \\\\mathrm{N/m}$. The only other force in the co-accelerating (tube) frame is the uniform inertial force, $F_{\\\\rm in} = -M a_{\\\\rm tube}$. All other forces, including gravity and friction, are absent.\\n\\nInitially, at $t=0$, the mass is instantaneously at rest ($\\\\dot y = 0$) at position $y=0$ (the boundary between the spring regions). The mechanical energy in the tube frame is conserved; any potential energy reference is set so that $U(0) = 0$.\\n\\nSuppose now that at the moment of release, a brief laser pulse instantaneously imparts an additional upward velocity $v_0 = 4.36\\\\ \\\\mathrm{m/s}$ to the mass at $y=0$, without otherwise interacting with the system. For the **first excursion after release only**, calculate the exact positive turning point displacement $y_{\\\\max}>0$ reached by the mass before reversing direction, under the above piecewise restoring forces and inertial force. Express your answer numerically in meters, **to three significant digits**.\\n\\n\\n\\\\[\\n\\\\boxed{y_{\\\\max}\\\\ [{\\\\rm m}] = \\\\ ?}\\n\\\\]\",\n  \"topic_tags\": [\"classical-mechanics\", \"oscillations\", \"non-inertial-frames\", \"piecewise-potentials\", \"energy-methods\"]\n}",
    "feedback": "Ambiguities and missing definitions: “proper acceleration” is invoked but never distinguished from ordinary coordinate acceleration; if a relativistic meaning is intended, the frame-dependence of 3.70 m s⁻² should be clarified or, if speeds are assumed non-relativistic, the adjective “proper” is superfluous and potentially misleading.  The statement “mechanical energy in the tube frame is conserved” is asserted without argument; energy conservation in a uniformly accelerating, non-inertial frame is only valid because the pseudo-force derives from a time-independent potential U_in = M a_tube y—this should be stated explicitly.  The piecewise spring law for y<0 is irrelevant for the “first excursion” (the mass never enters y<0 after an initial positive kick), yet the parameter k₁ is introduced and never used, inviting confusion.  All symbols (M, k₁, k₂, a_tube, v₀, y_max) are defined, but ẏ(t) and “proper acceleration” appear before being contextualised.  Logical flow is otherwise sound: energy at y=0 (½Mv₀²) equals the sum ½k₂y_max² + M a_tube y_max at the turning point, but this reasoning chain is not spelled out, so a reader must supply it.  Hidden assumptions: gravity is declared absent but the physical realism of a frictionless, infinitely long, perfectly rigid tube in flat space with no gravity is not addressed; likewise, the laser pulse is idealised as an instantaneous momentum transfer with no position change.  No intermediate sub-questions are posed and the final request is a single numeric value in SI units, so the overall structure satisfies the “single answer” requirement.  To tighten the problem, drop k₁ or postpone its introduction, replace “proper” with “constant” acceleration (or state “relativistic effects are negligible”), and explicitly mention the inertial potential U_in to justify energy conservation.",
    "improved_question": "{\n  \"question\": \"A point mass $M = 1.50~\\\\mathrm{kg}$ moves without friction along a straight, infinitely long, perfectly rigid tube aligned with the $y$-axis. The entire tube is subjected to a uniform, constant coordinate acceleration $a_{\\\\text{tube}} = 3.70~\\\\mathrm{m/s}^2$ along the $+y$ direction relative to an inertial laboratory frame. All relativistic effects may be neglected; assume standard Newtonian mechanics. Gravity and any environmental forces are absent. All dynamics will be analyzed in the tube's non-inertial reference frame. In this frame, the only present inertial (pseudo-)force acts uniformly and derives from the time-independent potential $U_{\\\\text{in}}(y) = -M a_{\\\\text{tube}} y$. The mass is additionally subject to a restoring spring force given by\\n\\\\[\\nF_{\\\\text{s}}(y) = -k_2 y, \\\\qquad\\\\text{with}\\\\quad k_2 = 470~\\\\mathrm{N/m},\\\\quad\\\\text{for}\\\\quad y>0,\\n\\\\]\\nand $F_{\\\\text{s}}(y) = 0$ for $y \\\\leq 0$. (For this problem, the region $y \\\\leq 0$ will not be accessed.)\\n\\nAt time $t=0$ in the tube frame, the mass is located at $y=0$ and is momentarily at rest $(\\\\dot{y}=0)$. An external laser pulse applied instantaneously at $y=0$ imparts an additional upward velocity $v_0 = 4.36~\\\\mathrm{m/s}$ to the mass, with no change to its position. Assume the laser pulse acts so briefly that no external force acts at any other $y$. After this kick, the mass moves subject only to the spring and inertial forces described above. Use the potential energy reference $U(0) = 0$, where the total potential is $U(y) = U_{\\\\text{s}}(y) + U_{\\\\text{in}}(y)$ with $U_{\\\\text{s}}(y) = \\\\tfrac{1}{2}k_2 y^2$.\\n\\nIn the tube frame, mechanical energy is conserved. The parameters $M$, $k_2$, $a_{\\\\text{tube}}$, and $v_0$ are as given above.\\n\\n\\\\textbf{Calculate the exact maximum displacement $y_{\\\\text{max}} > 0$ reached by the mass before turning back (i.e., the largest $y > 0$ it attains during its initial post-kick excursion), under these physical conditions. Express your answer numerically in meters, \\\\emph{to three significant digits}.}\\n\\n\\\\[\\n\\\\boxed{y_{\\\\text{max}}\\\\; [\\\\mathrm{m}] =\\\\; ?}\\n\\\\]\",\n  \"topic_tags\": [\n    \"classical-mechanics\",\n    \"oscillations\",\n    \"non-inertial-frames\",\n    \"energy-conservation\",\n    \"piecewise-forces\"\n  ]\n}",
    "ans_gpt": "y_max = 0.258 m",
    "ans_o3": "\\(\\boxed{y_{\\text{max}} = 0.258\\ \\text{m}}\\)",
    "similarity_result": {
      "similarity_score": 1.0,
      "decision": "similar",
      "comment": "Identical numerical value and matching units; expressions are the same."
    }
  }
]